app/views/personas/_form.html.erb

<!-- Si da error y regresca la pagina me direcciona a personas y pierdo la variable. Tengo que corregir -->
<% @empresas = Empresa.all %>
---
SELECT `empresas`.* FROM `empresas`