app/controllers/empresas_controller.rb

  def show
    @empresa = Empresa.find(params[:id])
---
SELECT  `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 0 LIMIT 1

  def edit
    @empresa = Empresa.find(params[:id])
---
SELECT  `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1 LIMIT 1

  def create
    @empresa = Empresa.new(empresa_params)
    @empresa.activo = true

    if @empresa.save
---
INSERT INTO `empresas` (`cuit`, `nombre`, `created_at`, `updated_at`) VALUES (20301254569, 'Etap', '2017-12-18 19:39:42', '2017-12-18 19:39:42')