app/controllers/personas_controller.rb

SELECT  `personas`.* FROM `personas` WHERE `personas`.`id` = 1 LIMIT 1
---
  def show
    @persona = Persona.find(params[:id])

SELECT `empresas`.* FROM `empresas`
---
  def new
    @persona = Persona.new
    @empresas = Empresa.all

INSERT INTO `personas` (`num_legajo`, `apellido`, `nombre`, `dni`, `fecha_vencimiento_dni`, `pdf_dni_path`, `cuil`, `pdf_cuil_path`, `fecha_nacimiento`, `nacionalidad`, `domicilio`, `telefono`, `activo`, `created_at`, `updated_at`) VALUES (156, 'Perez', 'Pepe', 20156540, '2017-12-15', 'ZMA-Cotizador-ESET-061017-V1.pdf', 20201565403, 'Lopez_Mhirta_Alejandra.pdf', '2017-12-14', 'peru', 'islas leones', 154131685, 1, '2017-12-18 22:47:03', '2017-12-18 22:47:03')
---
  def create
    @persona = Persona.new(persona_params)
    @persona.activo = true

    if @persona.save